S5J3_TheGossipProject-master/app/controllers/cities_controller.rb

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
---
  def show
    @city = City.find(params[:id])