S5J3_TheGossipProject-master/app/controllers/comments_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 145], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 144], ["LIMIT", 1]]
---
  def show
    @gossip_id = Gossip.find(params['gossip_id']).id
    @comment = Comment.find_by(@gossip_id)

INSERT INTO "comments" ("content", "gossip_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "test"], ["gossip_id", 81], ["user_id", 58], ["created_at", "2019-05-02 14:39:43.140220"], ["updated_at", "2019-05-02 14:39:43.140220"]]
---
  def create
    Comment.create(content: params[:content], user_id: current_user.id, gossip_id: params[:gossip_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 71], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "coeur coeur final"], ["updated_at", "2019-05-01 20:23:44.427662"], ["id", 11]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "fd"], ["updated_at", "2019-05-02 15:08:28.931391"], ["id", 2]]
---
  def update
    @comment = Comment.find(params[:id])
    @gossip_precis = Gossip.find(params[:gossip_id])
    @comment.save

    if @comment.update(content: params[:content])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 145], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 12]]
---
  def destroy
     @comment = Comment.find(params[:id])
     @gossip_precis = Gossip.find(params[:gossip_id])
     @comment.destroy