S5J3_TheGossipProject-master/app/controllers/gossips_controller.rb

  def index
    @gossip = Gossip.all
---
SELECT "gossips".* FROM "gossips"

  def show
    @gossip_precis = Gossip.find(params[:id])
    @gossip_user_id = @gossip_precis.user_id
    @gossip_user_city_id = User.find(@gossip_user_id).city_id
    @gossip_user_city = City.find(@gossip_user_city_id).name
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 81], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]

  def create
    @gossip_new = Gossip.new(title: params[:title], content: params[:content], user: current_user)
    @gossip_new.save
---
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "ciao"], ["content", "problems"], ["user_id", 41], ["created_at", "2019-05-01 10:38:52.401017"], ["updated_at", "2019-05-01 10:38:52.401017"]]

  def edit
    @gossip_precis = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 81], ["LIMIT", 1]]

  def update
    @gossip_precis = Gossip.find(params[:id])

    if @gossip_precis.update(gossip_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 81], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["content", "testeditds"], ["updated_at", "2019-05-02 15:39:38.398556"], ["id", 81]]

  def destroy
        @gossip_precis = Gossip.find(params[:id])
        @gossip_precis.destroy
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 63]]

def is_the_same_user?
  @gossip_precis = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 81], ["LIMIT", 1]]