S5J3_TheGossipProject-master/app/controllers/users_controller.rb

	def show
		@user_precis = User.find(params[:id])
		@user_city_id = @user_precis.city_id
		@user_city = City.find(@user_city_id).name
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]

	def create
		@user = User.create(email: params[:email], password: params[:password], city_id: City.all.sample.id)
---
INSERT INTO "users" ("email", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "cities".* FROM "cities"