S5J3_TheGossipProject-master/app/views/gossips/index.html.erb

SELECT "gossips".* FROM "gossips"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---

    <%= "gossip de   #{g.user.first_name} #{g.user.last_name}" %>

SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 143]]
---

     <p> comment: <span class="badge badge-primary badge-pill"> <%=g.comments.count %></span> </p>